Revit 2026 API

# IFCFamilyInstanceExtrusionExportResults Class

---

This class represents the results of a geometric analysis of a family instance.

SystemObject Autodesk.Revit.DB.IFCIFCFamilyInstanceExtrusionExportResults

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCFamilyInstanceExtrusionExportResults : IDisposable
```
```vb
Public Class IFCFamilyInstanceExtrusionExportResults
	Implements IDisposable
```
```cpp
public ref class IFCFamilyInstanceExtrusionExportResults : IDisposable
```
```fsharp
type IFCFamilyInstanceExtrusionExportResults =
    class
        interface IDisposable
    end
```

The IFCFamilyInstanceExtrusionExportResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExtraOffset | The extra offset determined from the geometry of the family instance. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | The best material id determined for the family instance. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCFamilyInstanceExtrusionExportResults |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCutPairOpenings | Gets the set of "openings" determined from the analysis of the instance geometry. |
|  | GetExtrusionHandle | Gets the extruded solid handle generated for the family instance. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The analysis attempts to convert the geometry of the instance into a single extrusion with additional extruded openings cutting the main solid.

#### Reference

Autodesk.Revit.DB.IFC Namespace